HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_OFF (16)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_OFF (4)

/** \\brief  Length for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_LEN (32)

/** \\brief  Mask for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_LEN (32)

/** \\brief  Mask for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_OFF (0)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_OFF (4)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_OFF (6)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_LEN (4)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_OFF (12)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_OFF (28)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_OFF (30)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_CHCTR_CHEVMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_CHCTR_CHEVMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_CHCTR_CHEVMODE_OFF (8)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_OFF (11)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_OFF (21)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_OFF (16)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_OFF (20)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_OFF (10)

/** \\brief  Length for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_LEN (4)

/** \\brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_OFF (0)

/** \\brief  Length for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_LEN (4)

/** \\brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_MSK (0x1f)

