HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_OFF (19)

/** \\brief  Length for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_LEN (12)

/** \\brief  Mask for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_MSK (0xfff)

/** \\brief  Offset for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_LEN (12)

/** \\brief  Mask for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_MSK (0xfff)

/** \\brief  Offset for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV10 */
#define IFX_VADC_G_CEFCLR_CEV10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV10 */
#define IFX_VADC_G_CEFCLR_CEV10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV10 */
#define IFX_VADC_G_CEFCLR_CEV10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV11 */
#define IFX_VADC_G_CEFCLR_CEV11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV11 */
#define IFX_VADC_G_CEFCLR_CEV11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV11 */
#define IFX_VADC_G_CEFCLR_CEV11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV12 */
#define IFX_VADC_G_CEFCLR_CEV12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV12 */
#define IFX_VADC_G_CEFCLR_CEV12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV12 */
#define IFX_VADC_G_CEFCLR_CEV12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV13 */
#define IFX_VADC_G_CEFCLR_CEV13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV13 */
#define IFX_VADC_G_CEFCLR_CEV13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV13 */
#define IFX_VADC_G_CEFCLR_CEV13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV14 */
#define IFX_VADC_G_CEFCLR_CEV14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV14 */
#define IFX_VADC_G_CEFCLR_CEV14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV14 */
#define IFX_VADC_G_CEFCLR_CEV14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV15 */
#define IFX_VADC_G_CEFCLR_CEV15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV15 */
#define IFX_VADC_G_CEFCLR_CEV15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV15 */
#define IFX_VADC_G_CEFCLR_CEV15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV6 */
#define IFX_VADC_G_CEFCLR_CEV6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV6 */
#define IFX_VADC_G_CEFCLR_CEV6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV6 */
#define IFX_VADC_G_CEFCLR_CEV6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV7 */
#define IFX_VADC_G_CEFCLR_CEV7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV7 */
#define IFX_VADC_G_CEFCLR_CEV7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV7 */
#define IFX_VADC_G_CEFCLR_CEV7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV8 */
#define IFX_VADC_G_CEFCLR_CEV8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV8 */
#define IFX_VADC_G_CEFCLR_CEV8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV8 */
#define IFX_VADC_G_CEFCLR_CEV8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV9 */
#define IFX_VADC_G_CEFCLR_CEV9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV9 */
#define IFX_VADC_G_CEFCLR_CEV9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV9 */
#define IFX_VADC_G_CEFCLR_CEV9_OFF (9)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV0 */
#define IFX_VADC_G_CEFLAG_CEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV0 */
#define IFX_VADC_G_CEFLAG_CEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV0 */
#define IFX_VADC_G_CEFLAG_CEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV10 */
#define IFX_VADC_G_CEFLAG_CEV10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV10 */
#define IFX_VADC_G_CEFLAG_CEV10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV10 */
#define IFX_VADC_G_CEFLAG_CEV10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV11 */
#define IFX_VADC_G_CEFLAG_CEV11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV11 */
#define IFX_VADC_G_CEFLAG_CEV11_MSK (0x1)

